sdaiGetADBValue(Sdai_ADBId*,SdaiPrimitiveType,System.Void*)
\details
Retrieves the value of a specified type from the attribute data block (ADB).
\param block     [in] An ADB instance.
\param valueType [in] A value type.
\param value     [out] A raw pointer to the buffer to write the result.
\returns A raw pointer to the value if the value was successfully retrieved; otherwise, the function returns the NULL value.